<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">

<!--Converted with LaTeX2HTML 2008 (1.71)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>"Sistemas Operacionais 2013/1"</TITLE>
<META NAME="description" CONTENT=""Sistemas Operacionais 2013/1"">
<META NAME="keywords" CONTENT="tp3">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2008">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="tp3.css">

</HEAD>

<BODY >
<!--Navigation Panel-->
<IMG WIDTH="81" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next_inactive"
 SRC="file:/opt/local/share/lib/latex2html/icons/nx_grp_g.png"> 
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/opt/local/share/lib/latex2html/icons/up_g.png"> 
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/opt/local/share/lib/latex2html/icons/prev_g.png">   
<BR>
<BR>
<BR>
<!--End of Navigation Panel-->

<P>

<P>
<DIV ALIGN="CENTER">
<FONT SIZE="+1">Sistemas Operacionais</FONT>
<BR>  <FONT SIZE="+2"><B>TP3: </B></FONT> simula&#231;&#227;o de um sistema de mem&#243;ria virtual
<BR>
Trabalho individual ou em dupla.
<BR>
Data de entrega: verifique o
  <A NAME="tex2html1"
  HREF="curso.html">calend&#225;rio do curso</A>
<BR>  <B>(N&#227;o ser&#227;o aceitos trabalhos fora do prazo)</B>
<BR> <A NAME="tex2html2"
  HREF="tp3.pdf">Enunciado do trabalho em PDF</A>
<BR> 
</DIV>

<P>
Este trabalho tem por objetivo fazer com que os alunos tenham contato com o
tipo de c&#243;digo usado em simuladores e apliquem os conceitos de mem&#243;ria
virtual vistos em sala de aula.

<P>

<H2><A NAME="SECTION00001000000000000000">
O problema</A>
</H2>
<BR>

<P>
Neste trabalho voc&#234; deve implementar um simulador de mem&#243;ria virtual.
Ao contr&#225;rio dos trabalhos anteriores, este programa 
n&#227;o se relaciona diretamente
com aspectos do sistema operacional, mas dentro dele voc&#234; dever&#225;
implementar uma r&#233;plica das estruturas de um mecanismo de ger&#234;ncia de
mem&#243;ria virtual. De certa forma, este ser&#225; um trabalho de programa&#231;&#227;o 
``mais tradicional''.

<P>

<H2><A NAME="SECTION00002000000000000000">
Princ&#237;pio geral</A>
</H2>

<P>
Seu programa dever&#225; ser implementado em C (n&#227;o ser&#227;o aceitos recursos de
C++, como classes da biblioteca padr&#227;o ou de outras fontes).

<P>
O simulador receber&#225; como entrada um arquivo que conter&#225; a sequ&#234;ncia de
endere&#231;os de mem&#243;ria acessados por um programa real (na verdade, apenas um
pedacinho da sequ&#234;ncia total de acessos de um programa). Esses endere&#231;os
estar&#227;o escritos como n&#250;meros hexadecimais, seguidos por uma letra R ou W,
para indicar se o acesso foi de leitura ou escrita. Ao iniciar o programa,
ser&#225; definido o tamanho da mem&#243;ria (em quadros) para aquele programa e qual
o algoritmo de substitui&#231;&#227;o de p&#225;ginas a ser utilizado. O programa deve,
ent&#227;o, processar cada acesso &#224; mem&#243;ria para atualizar os bits de controle
de cada quadro, detectar falhas de p&#225;ginas (<I>page faults</I>) e simular o
processo de carga e substitui&#231;&#227;o de p&#225;ginas. Durante todo esse processo,
estat&#237;sticas devem ser coletadas, para gerar um relat&#243;rio curto ao final da
execu&#231;&#227;o.

<P>

<H2><A NAME="SECTION00003000000000000000">
Forma de opera&#231;&#227;o</A>
</H2>

<P>
O programa, que dever&#225; se chamar <TT>tp3virtual</TT>, dever&#225; 
ser iniciado com quatro argumentos:
<BR> <TT>tp3virtual lru arquivo.log 4 128</TT>
<BR>
Esse argumentos representam, pela ordem:

<OL>
<LI>o algoritmo de substitui&#231;&#227;o a ser usado (<TT>lru</TT>,
        <TT>fifo</TT> ou <TT>random</TT>);
</LI>
<LI>o arquivo contendo a sequ&#234;ncia de endere&#231;os de mem&#243;ria acessados
        (<TT>arquivo.log</TT>, nesse exemplo);
</LI>
<LI>o tamanho de cada p&#225;gina/quadro de mem&#243;ria, em kilobytes -- faixa
        de valores razo&#225;veis: de 2 a 64;
</LI>
<LI>o tamanho total da mem&#243;ria f&#237;sica dispon&#237;vel para o processo,
        tamb&#233;m em kilobytes -- faixa de valores razo&#225;veis: de 128 a 16384 (16 MB).
</LI>
</OL>

<P>

<H2><A NAME="SECTION00004000000000000000">
Formato da sa&#237;da</A>
</H2>

<P>
Ao final da simula&#231;&#227;o, quando a sequ&#234;ncia de acessos &#224; mem&#243;ria terminar, o
programa deve gerar um pequeno relat&#243;rio, contendo:

<UL>
<LI>a configura&#231;&#227;o utilizada (definida pelos quatro par&#226;metros);
</LI>
<LI>o n&#250;mero total de acessos &#224; mem&#243;ria contidos no arquivo;
</LI>
<LI>o n&#250;mero de <I>page faults</I> (p&#225;ginas lidas);
</LI>
<LI>o n&#250;mero de p&#225;ginas ``sujas'' que tiveram que ser escritas de volta
        no disco (lembrando-se que p&#225;ginas sujas que existam no final da
        execu&#231;&#227;o n&#227;o precisam ser escritas).
</LI>
</UL>

<P>
Um exemplo de sa&#237;da poderia ser da forma (valores completamente fict&#237;cios):
<BR> 
<TABLE  WIDTH="80%">
<TR><TD>
<PRE> 
    prompt&gt; tp3virtual lru arquivo.log 4 128
    Executando o simulador...
    Arquivo de entrada: arquivo.log
    Tamanho da memoria: 128 KB
    Tamanho das páginas: 4 KB
    Tecnica de reposicao: lru
    Paginas lidas: 520
    Paginas escritas: 352
</PRE></TD></TR>
</TABLE>

<P>

<H2><A NAME="SECTION00005000000000000000">
Formato do arquivo de entrada</A>
</H2>

<P>
Como mencionado anteriormente, cada linha cont&#233;m um endere&#231;o de mem&#243;ria
acessado, seguido das letras R ou W, indicando um acesso de leitura ou
escrita, respectivamente. Por exemplo, as linhas a seguir foram retiradas
de um dos arquivos utilizados:

<P>
 
<TABLE  WIDTH="80%">
<TR><TD>
<PRE> 
0785db58 W
000652d8 R
0005df58 W
000652e0 R
0785db50 W
000652e0 R
31308800 R
00062368 R
</PRE></TD></TR>
</TABLE>

<P>
Os arquivos fornecidos representam o registro de todas as opera&#231;&#245;es de
acesso &#224; mem&#243;ria observadas durante a execu&#231;&#227;o real de alguns programas
considerados significativos de classes de programas reais:

<UL>
<LI><A NAME="tex2html3"
  HREF="compilador.zip"><TT><B>compilador.log</B></TT></A>:
        execu&#231;&#227;o de um compilador, que
        normalmente utiliza um grande n&#250;mero de estruturas de dados
        internas complexas;
</LI>
<LI><A NAME="tex2html4"
  HREF="matriz.zip"><TT><B>matriz.log</B></TT></A>:
        um programa cient&#237;fico que utiliza 
        c&#225;lculos matriciais relativamente simples, mas sobre grandes
        matrizes e vetores;
</LI>
<LI><A NAME="tex2html5"
  HREF="compressor.zip"><TT><B>compressor.log</B></TT></A>:
        um programa de compress&#227;o de
        arquivos, que usa estruturas de dados mais simples;
</LI>
<LI><A NAME="tex2html6"
  HREF="simulador.zip"><TT><B>simulador.log</B></TT></A>:
        um simulador de part&#237;culas, que
        executa c&#225;lculos complexos sobre estruturas relativamente simples.
</LI>
</UL>
Todos os arquivos est&#227;o compactados (.zip) e devem ser descompactados antes
de serem usados.

<P>
A leitura do arquivo pode ser feita com o comando <TT>scanf()</TT>, como no
trecho a seguir:
<BR>
<P>
 
<TABLE  WIDTH="80%">
<TR><TD>
<PRE> 
    unsigned addr;
    char rw;
        ...
    fscanf(file,"%x %c",&amp;addr,&amp;rw);
</PRE></TD></TR>
</TABLE>

<P>

<H2><A NAME="SECTION00006000000000000000">
Determina&#231;&#227;o da p&#225;gina a partir do endere&#231;o</A>
</H2>

<P>
Como visto em sala, para se identificar a p&#225;gina associada a um endere&#231;o,
basta descartar os <IMG
 WIDTH="14" HEIGHT="17" ALIGN="BOTTOM" BORDER="0"
 SRC="tp3-img1.png"
 ALT="$s$"> bits menos significativos do endere&#231;o. Se a p&#225;gina
fosse fixada em 4 KB, <IMG
 WIDTH="14" HEIGHT="17" ALIGN="BOTTOM" BORDER="0"
 SRC="tp3-img1.png"
 ALT="$s$"> seria sempre 12. Entretanto, para se implementar
um tamanho de p&#225;gina vari&#225;vel, <IMG
 WIDTH="14" HEIGHT="17" ALIGN="BOTTOM" BORDER="0"
 SRC="tp3-img1.png"
 ALT="$s$"> deve ser calculado a cada execu&#231;&#227;o.
Para simplificar, vamos assumir que o tamanho da p&#225;gina ser&#225; sempre
fornecido como uma pot&#234;ncia de 2 (n&#227;o &#233; necess&#225;rio checar). O c&#243;digo para
se determinar <IMG
 WIDTH="14" HEIGHT="17" ALIGN="BOTTOM" BORDER="0"
 SRC="tp3-img1.png"
 ALT="$s$"> pode ser:

<P>
 
<TABLE  WIDTH="40%">
<TR><TD>
<PRE> 
    unsigned s, page_size, tmp;

    /* Derivar o valor de s: */
    tmp = page_size;
    s = 0;
    while (tmp&gt;1) {
        tmp = tmp&gt;&gt;1;
        s++;
    }
</PRE></TD></TR>
</TABLE>

<P>
Nesse caso, para um endere&#231;o <TT>addr</TT>, a p&#225;gina pode ser determinada
simplesmente fazendo-se <code>page = addr &gt;&gt; s;</code>

<P>

<H2><A NAME="SECTION00007000000000000000">
Implementa&#231;&#227;o da tabela de p&#225;ginas</A>
</H2>

<P>
Como os endere&#231;os s&#227;o de 32 bits nos arquivos fornecidos, para p&#225;ginas de 2
KB (as menores que precisam ser consideradas), podemos ter at&#233; 21 bits de
identifica&#231;&#227;o de p&#225;gina, isto &#233;, uma tabela de p&#225;gina de mais de dois
milh&#245;es de entradas. Se cada entrada da tabela tiver um inteiro para
identificar a p&#225;gina f&#237;sica, teremos um vetor de 8 MB. N&#227;o ser&#225; muito
eficiente, mas para fins do simulador, essa organiza&#231;&#227;o &#233; aceit&#225;vel. Voc&#234;s
devem se preocupar em montar uma tabela de p&#225;ginas hier&#225;rquica, como seria
realmente implementada na pr&#225;tica; isso geraria uma complexidade adicional
que n&#227;o seria muito &#250;til. Voc&#234;s podem tamb&#233;m implementar uma tabela de
p&#225;ginas reversa, ou uma tabela por <I>hash</I>, caso se sintam inspirados.

<P>
A estrutura de dados para representar cada quadro f&#237;sico deve conter campos
para registrar atributos como p&#225;gina referenciada, instante do &#250;ltimo
acesso, p&#225;gina alterada, etc. (os detalhes s&#227;o parte da implementa&#231;&#227;o e v&#227;o
depender da forma como voc&#234;s implementarem cada algoritmo).

<P>

<H2><A NAME="SECTION00008000000000000000">
Implementa&#231;&#227;o dos algoritmos de reposi&#231;&#227;o</A>
</H2>

<P>
Os detalhes de outras estruturas de dados que podem vir a ser usadas para
os algoritmos s&#227;o de livre escolha dos implementadores. Voc&#234;s devem
documentar no relat&#243;rio como cada algoritmo foi implementado e
certificar-se de que o desempenho final do simulador n&#227;o seja demasiado
lento (preferivelmente na ordem de segundos, n&#227;o dezenas de minutos).

<P>
Voc&#234;s podem utilizar um contador que inicie em zero e seja incrementado a
cada acesso &#224; mem&#243;ria, como a forma de manter o tempo de cada
acesso/leitura/escrita, quando necess&#225;rio. 

<P>
Para a implementa&#231;&#227;o da pol&#237;tica aleat&#243;ria, as fun&#231;&#245;es <TT>random()</TT> e
<TT>srandom()</TT> podem ser usadas para se controlar o gerador de n&#250;meros
aleat&#243;rios. Para se gerar um n&#250;mero entre 0 e n, a express&#227;o
<TT>(random() % n)</TT> &#233; suficiente. Note-se que enquanto houver p&#225;ginas
vazias na mem&#243;ria elas devem ser preenchidas; apenas quando a mem&#243;ria
estiver completamente ocupada uma p&#225;gina aleat&#243;ria deve ser substitu&#237;da.

<P>

<H2><A NAME="SECTION00009000000000000000">
Verifica&#231;&#227;o do funcionamento do programa</A>
</H2>

<P>
Apesar da vers&#227;o a ser entregue precisar gerar apenas o relat&#243;rio final
descrito anteriormente, recomenda-se fortemente que o programa tenha um
modo ``depura&#231;&#227;o'' onde ele escreva uma linha (ou mais) descrevendo o
que &#233; feito a cada acesso &#224; mem&#243;ria. Assim, utilizando-se um arquivo de
teste reduzido (e possivelmente escrito especialmente para testar cada caso
de opera&#231;&#227;o) voc&#234; pode acompanhar a opera&#231;&#227;o do programa passo-a-passo.
Para isso, &#233; permitido prever um quinto par&#226;metro, opcional, que seja
definido quando se deseje que o programa tenha esse comportamento com sa&#237;da
detalhada. A forma desse par&#226;metro &#233; de escolha dos desenvolvedores. Pode
ser uma palavra, como <TT>debug</TT>, pode ser qualquer coisa (apenas para
configurar um quinto argumento), ou pode ser um n&#250;mero, que pode ser usado
para especificar um grau de detalhamento (n&#250;meros maiores geram mensagens
de depura&#231;&#227;o mais detalhadas, por exemplo).

<P>

<H2><A NAME="SECTION000010000000000000000">
O que deve ser entregue</A>
</H2>

<P>
Voc&#234; deve entregar no moodle um arquivo .zip ou .tgz contendo o(s)
arquivo(s) contendo o c&#243;digo fonte do programa (.c e .h), um
<TT>Makefile</TT> e um relat&#243;rio sobre o seu trabalho. 
<B>N&#227;o inclua os arquivos de teste no processo de entrega!</B>

<P>
O relat&#243;rio deve conter:

<UL>
<LI>Um resumo do projeto: 
alguns par&#225;grafos que descrevam a estrutura geral do seu
c&#243;digo e todas as estruturas importantes.
</LI>
<LI>Decis&#245;es de projeto: descreva como voc&#234; lidou com quaisquer ambiguidades
na especifica&#231;&#227;o. Por exemplo, para este projeto, explicar como seu
interpretador
lida com linhas que n&#227;o t&#234;m comandos, apenas manipula&#231;&#227;o de arquivos.
</LI>
<LI>Uma an&#225;lise do desempenho dos algoritmos de substitui&#231;&#227;o de p&#225;ginas
    para os v&#225;rios programas utilizados.
</LI>
</UL>

<P>
Essa an&#225;lise de desempenho &#233; uma parte importante do trabalho e ser&#225;
respons&#225;vel por uma fra&#231;&#227;o significativa da nota (+/- 40%). Em diversos
momentos precisamos comparar algoritmos, determinar o que esperar em
diferentes condi&#231;&#245;es. Seu relat&#243;rio deve avaliar o comportamento dos tr&#234;s
algoritmos de reposi&#231;&#227;o de p&#225;gina para os quatro programas, em duas
situa&#231;&#245;es: quando o tamanho da mem&#243;ria cresce, com p&#225;ginas de 4 KB, e
quando o tamanho da mem&#243;ria fica constante, mas o tamanho das p&#225;ginas varia
de 2 KB a 64 KB (em pot&#234;ncias de 2).

<P>
Finalmente, embora voc&#234; possa desenvolver o seu c&#243;digo em qualquer sistema
que quiser, certifique-se que ele execute corretamente
na m&#225;quina virtual com o sistema operacional Linux que foi distribu&#237;da no
in&#237;cio do curso. A avalia&#231;&#227;o do seu funcionamento ser&#225; feita naquele
ambiente.

<P>

<H2><A NAME="SECTION000011000000000000000">
Considera&#231;&#245;es finais</A>
</H2>

<P>
Este trabalho n&#227;o &#233; t&#227;o complexo quanto pode parecer &#224; primeira vista.
O c&#243;digo neste caso pode vir a ser mais extenso que o do TP3, mas ainda
n&#227;o deve ser excessivamente longo. Evite optar por estruturas de dados
excessivamente complexas em uma primeira implementa&#231;&#227;o. Use a no&#231;&#227;o de
tipos abstratos de dados (TADs) para definir cada estrutura de dados que
seja necess&#225;ria e comece com uma implementa&#231;&#227;o simples. Certifique-se de
que a l&#243;gica do programa esteja funcionando. Se, depois disso, o desempenho
com os arquivos de teste fornecidos for muito ruim, s&#243; ent&#227;o considere o
uso de estruturas mais sofisticadas (elas n&#227;o ser&#227;o necessariamente
necess&#225;rias). 

<P>

<OL>
<LI><B>D&#250;vidas:</B> usem o moodle (minha.ufmg).
</LI>
<LI>Comece a fazer o trabalho logo, pois apesar do programa final ser
    relativamente pequeno, o tempo n&#227;o &#233; muito  e
o prazo de entrega n&#227;o vai ficar maior do que ele &#233; hoje (independente de
que dia &#233; hoje).
</LI>
<LI>V&#227;o valer pontos clareza, qualidade do c&#243;digo e da documenta&#231;&#227;o e,
  obviamente, a execu&#231;&#227;o correta da chamada do sistema com programas de
  teste. A participa&#231;&#227;o nos f&#243;runs de forma positiva tamb&#233;m ser&#225; considerada.
</LI>
</OL>
<FONT SIZE="-1">&#218;ltima altera&#231;&#227;o: May 29, 2013</FONT>
<BR>
<P>
<HR>
<!--Navigation Panel-->
<IMG WIDTH="81" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next_inactive"
 SRC="file:/opt/local/share/lib/latex2html/icons/nx_grp_g.png"> 
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/opt/local/share/lib/latex2html/icons/up_g.png"> 
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/opt/local/share/lib/latex2html/icons/prev_g.png">   
<BR>
<!--End of Navigation Panel-->
<ADDRESS>
Dorgival Guedes
2013-05-29
</ADDRESS>
</BODY>
</HTML>
